; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v2 - type_3 ?v6 - type_2)
 	      (pred_2 ?v8 - object ?v6 - type_2)
	      (pred_3 ?v2 - type_3 ?v1 - type_1)
	      (pred_1 ?v2 - type_3 ?v8 - object ?v1 - type_1))

   (:action op_1
       :parameters  (?v2 - type_3 ?v5 ?v7 - type_2)
       :precondition (and  (pred_4 ?v2 ?v5))
       :effect (and  (pred_4 ?v2 ?v7)
		     (not (pred_4 ?v2 ?v5))))

   (:action op_2
       :parameters (?v2 - type_3 ?v4 - object ?v3 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_2 ?v4 ?v3) (pred_4 ?v2 ?v3) (pred_3 ?v2 ?v1))
       :effect (and (pred_1 ?v2 ?v4 ?v1)
		    (not (pred_2 ?v4 ?v3)) 
		    (not (pred_3 ?v2 ?v1))))

   (:action op_3
       :parameters (?v2 - type_3 ?v4 - object ?v3 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_1 ?v2 ?v4 ?v1) (pred_4 ?v2 ?v3))
       :effect (and (pred_2 ?v4 ?v3)
		    (pred_3 ?v2 ?v1)
		    (not (pred_1 ?v2 ?v4 ?v1)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_03 obj_04 - type_3
obj_06 obj_01 obj_02 obj_11 - type_1
obj_09 obj_12 obj_10 - type_2
obj_08 obj_07 obj_05 - object)
(:init
(pred_4 obj_03 obj_12)
(pred_3 obj_03 obj_06)
(pred_3 obj_03 obj_01)
(pred_4 obj_04 obj_12)
(pred_3 obj_04 obj_02)
(pred_3 obj_04 obj_11)
(pred_2 obj_08 obj_09)
(pred_2 obj_07 obj_09)
(pred_2 obj_05 obj_10)
)
(:goal
(and
(pred_2 obj_08 obj_10)
(pred_2 obj_07 obj_09)
(pred_2 obj_05 obj_12)
)
)

(:constraints
  (always (not (pred_4 obj_03 obj_10)))
)
)

; plan
1. (op_1 obj_03 obj_12 obj_09)
   deleted: (pred_4 obj_03 obj_12)
   added: (pred_4 obj_03 obj_09)
   goals met: 1 of 3
2. (op_1 obj_04 obj_12 obj_10)
   deleted: (pred_4 obj_04 obj_12)
   added: (pred_4 obj_04 obj_10)
   goals met: 1 of 3
3. (op_2 obj_03 obj_08 obj_09 obj_01)
   deleted: (pred_2 obj_08 obj_09) (pred_3 obj_03 obj_01)
   added: (pred_1 obj_03 obj_08 obj_01)
   goals met: 1 of 3
4. (op_2 obj_04 obj_05 obj_10 obj_11)
   deleted: (pred_2 obj_05 obj_10) (pred_3 obj_04 obj_11)
   added: (pred_1 obj_04 obj_05 obj_11)
   goals met: 1 of 3
5. (op_1 obj_04 obj_10 obj_12)
   deleted: (pred_4 obj_04 obj_10)
   added: (pred_4 obj_04 obj_12)
   goals met: 1 of 3
6. (op_3 obj_03 obj_08 obj_09 obj_01)
   deleted: (pred_1 obj_03 obj_08 obj_01)
   added: (pred_2 obj_08 obj_09) (pred_3 obj_03 obj_01)
   goals met: 1 of 3
7. (op_3 obj_04 obj_05 obj_12 obj_11)
   deleted: (pred_1 obj_04 obj_05 obj_11)
   added: (pred_2 obj_05 obj_12) (pred_3 obj_04 obj_11)
   goals met: 2 of 3
8. (op_1 obj_04 obj_12 obj_09)
   deleted: (pred_4 obj_04 obj_12)
   added: (pred_4 obj_04 obj_09)
   goals met: 2 of 3
9. (op_2 obj_04 obj_08 obj_09 obj_11)
   deleted: (pred_2 obj_08 obj_09) (pred_3 obj_04 obj_11)
   added: (pred_1 obj_04 obj_08 obj_11)
   goals met: 2 of 3
10. (op_1 obj_04 obj_09 obj_10)
   deleted: (pred_4 obj_04 obj_09)
   added: (pred_4 obj_04 obj_10)
   goals met: 2 of 3
11. (op_3 obj_04 obj_08 obj_10 obj_11)
   deleted: (pred_1 obj_04 obj_08 obj_11)
   added: (pred_2 obj_08 obj_10) (pred_3 obj_04 obj_11)
   goals met: 3 of 3
